/*********************************************************************************************************
**
**                                北京翼辉信息技术有限公司
**
**                                  微型安全实时操作系统
**
**                                      MS-RTOS(TM)
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ms_boot_fatfs.h
**
** 创   建   人: Jiao.jinxing
**
** 文件创建日期: 2020 年 04 月 07 日
**
** 描        述: FAT 文件系统
*********************************************************************************************************/

#ifndef MS_BOOT_FATFS_H
#define MS_BOOT_FATFS_H

#ifdef __cplusplus
extern "C" {
#endif

#include "ms_boot_extfs.h"

int __ms_fatfs_result_to_errno(FRESULT fresult);

extern ms_boot_extfs_if_t ms_fatfs_if;

#ifdef __cplusplus
}
#endif

#endif                                                                  /*  MS_BOOT_FATFS_H             */
/*********************************************************************************************************
  END
*********************************************************************************************************/
