/*********************************************************************************************************
**
**                                北京翼辉信息技术有限公司
**
**                                  微型安全实时操作系统
**
**                                      MS-RTOS(TM)
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ms_flash_drv.h
**
** 创   建   人: Jiao.jinxing
**
** 文件创建日期: 2020 年 04 月 07 日
**
** 描        述: FLASH 驱动接口
*********************************************************************************************************/

#ifndef MS_FLASH_DRV_H
#define MS_FLASH_DRV_H

#ifdef __cplusplus
extern "C" {
#endif

ms_err_t ms_flash_unlock(void);

ms_err_t ms_flash_lock(void);

ms_err_t ms_flash_erase_os(void);

ms_err_t ms_flash_program(ms_addr_t addr, ms_const_ptr_t buf, ms_uint32_t len);

#ifdef __cplusplus
}
#endif

#endif                                                                  /*  MS_FLASH_DRV_H              */
/*********************************************************************************************************
  END
*********************************************************************************************************/
