/*********************************************************************************************************
**
**                                北京翼辉信息技术有限公司
**
**                                  微型安全实时操作系统
**
**                                      MS-RTOS(TM)
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ms_littlefs_drv.h
**
** 创   建   人: Jiao.jinxing
**
** 文件创建日期: 2020 年 04 月 07 日
**
** 描        述: littlefs 驱动接口
*********************************************************************************************************/

#ifndef MS_LITTLEFS_DRV_H
#define MS_LITTLEFS_DRV_H

#ifdef __cplusplus
extern "C" {
#endif

#include "littlefs/lfs.h"

ms_err_t ms_littlefs_init(lfs_t *lfs);

#ifdef __cplusplus
}
#endif

#endif                                                                  /*  MS_LITTLEFS_DRV_H           */
/*********************************************************************************************************
  END
*********************************************************************************************************/
